## Plan Result (1112: stg_aria - Terraform Plan Apply)




<pre><code>Plan: 6 to add, 18 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.config_json[&#34;01&#34;]
  * azurerm_storage_container.curated_extra[&#34;01-bronze&#34;]
  * azurerm_storage_container.curated_extra[&#34;01-gold&#34;]
  * azurerm_storage_container.curated_extra[&#34;01-silver&#34;]
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;00-af-active-ccd&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-active-ccd&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-td&#34;]
  * azurerm_storage_account.xcutting[&#34;00&#34;]
  * azurerm_storage_account.xcutting[&#34;01&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_storage_account_sas.xcutting["00"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # data.azurerm_storage_account_sas.xcutting["01"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # azurerm_linux_function_app.example["00-af-active-ccd"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-active-ccd-stg00-uks-dlrm-01"
        name                                           = "af-active-ccd-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-aplfpa-stg00-uks-dlrm-01"
        name                                           = "af-aplfpa-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-aplfta-stg00-uks-dlrm-01"
        name                                           = "af-aplfta-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-apluta-stg00-uks-dlrm-01"
        name                                           = "af-apluta-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-bails-stg00-uks-dlrm-01"
        name                                           = "af-bails-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-joh-stg00-uks-dlrm-01"
        name                                           = "af-joh-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-sbails-stg00-uks-dlrm-01"
        name                                           = "af-sbails-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-td-stg00-uks-dlrm-01"
        name                                           = "af-td-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-active-ccd"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Web/sites/af-active-ccd-stg01-uks-dlrm-01"
        name                                           = "af-active-ccd-stg01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Web/sites/af-aplfpa-stg01-uks-dlrm-01"
        name                                           = "af-aplfpa-stg01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Web/sites/af-aplfta-stg01-uks-dlrm-01"
        name                                           = "af-aplfta-stg01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Web/sites/af-apluta-stg01-uks-dlrm-01"
        name                                           = "af-apluta-stg01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Web/sites/af-bails-stg01-uks-dlrm-01"
        name                                           = "af-bails-stg01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Web/sites/af-joh-stg01-uks-dlrm-01"
        name                                           = "af-joh-stg01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Web/sites/af-sbails-stg01-uks-dlrm-01"
        name                                           = "af-sbails-stg01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["01-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Web/sites/af-td-stg01-uks-dlrm-01"
        name                                           = "af-td-stg01-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_storage_account.xcutting["00"] will be updated in-place
  ~ resource "azurerm_storage_account" "xcutting" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00xcuttingstg"
        name                               = "ingest00xcuttingstg"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = (known after apply)
          + default_action = "Allow"
          + ip_rules       = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_account.xcutting["01"] will be updated in-place
  ~ resource "azurerm_storage_account" "xcutting" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest01-main-stg/providers/Microsoft.Storage/storageAccounts/ingest01xcuttingstg"
        name                               = "ingest01xcuttingstg"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = (known after apply)
          + default_action = "Allow"
          + ip_rules       = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # azurerm_storage_blob.config_json["01"] will be created
  + resource "azurerm_storage_blob" "config_json" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "configs/env_config.json"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./tmp/config_stg_01.json"
      + storage_account_name   = "ingest01curatedstg"
      + storage_container_name = "bronze"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_container.curated_extra["01-bronze"] will be created
  + resource "azurerm_storage_container" "curated_extra" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "bronze"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest01curatedstg"
    }

  # azurerm_storage_container.curated_extra["01-gold"] will be created
  + resource "azurerm_storage_container" "curated_extra" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "gold"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest01curatedstg"
    }

  # azurerm_storage_container.curated_extra["01-silver"] will be created
  + resource "azurerm_storage_container" "curated_extra" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "silver"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest01curatedstg"
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "stg"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_stg_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "stg"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_stg_01.json"
      + id                   = (known after apply)
    }

Plan: 6 to add, 18 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 1112: stg_aria - Terraform Plan Apply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":211,"Program":"tfcmt","SHA1":"","Target":"1112: stg_aria - Terraform Plan Apply","Vars":{}} -->